perf/heavy_static.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    node_replicated:
      target: 'http://localhost:5555/node_replicated/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node_replicated"
    gunicorn:
      target: 'http://localhost:5555/gunicorn/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    gunicorn_multiple:
      target: 'http://localhost:5555/gunicorn_multiple/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    gunicorn_replicated:
      target: 'http://localhost:5555/gunicorn_replicated/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: RampUp
      duration: 30
      arrivalRate: 5
      rampTo: 20
    - name: Intensive
      duration: 30
      arrivalRate: 20
    - name: Stop
      pause: 5
    - name: Light
      duration: 30
      arrivalRate: 5

scenarios:
  - name: Heavy static (2 Mb)
    flow:
      - get:
          url: '/static/book.pdf'